# vim: ft=ruby

tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "neovim/neovim"
tap "theseal/ssh-askpass"
tap "universal-ctags/universal-ctags"

# Default GUI workstation
cask "brave-browser"
cask "vagrant"
cask "alfred"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "docker"
cask "telegram"
cask "evernote"
cask "firefox"
cask "simplenote"
cask "spectacle"
cask "font-FiraCode-nerd-font" unless ::Dir.glob("#{::File.expand_path('~')}/Library/Fonts/FiraCode-*.otf").any?

# Nice non-defaults
brew "ripgrep"
brew "bat"
brew "universal-ctags", args: ['head']

# Unix
brew "git"
brew "openssl"
brew "thoughtbot/formulae/rcm"
brew "reattach-to-user-namespace"
brew "tmux"
brew "neovim"
brew "zsh"
brew "gnupg"
brew "keychain"
brew "ssh-askpass"
brew "tree"
brew "watch"
brew "dos2unix"

# Fix MacOS with GNU
brew "ed"
brew "coreutils"
brew "binutils"
brew "gnutls"
brew "gzip"
brew "wget"
brew "bash"
brew "bash-completion"
brew "make"
brew "less"
brew "openssh"
brew "rsync"
brew "unzip"
brew "parallel"
brew "netcat"

# Image manipulation
brew "gifsicle"
brew "ffmpeg"
brew "graphviz"

# Appearance
brew "dark-mode"

# Testing
brew "shellcheck"
brew "qt"
brew "mitmproxy"
brew "jq"

# Programming languages
brew "libyaml" # should come after openssl
brew "sqlite"
brew "ruby"
