# vim: ft=ruby

HOME = ::File.expand_path('~').freeze

tap 'homebrew/services'
brew 'whalebrew'

'Dotfiles requirements'.tap do |_|
  brew 'direnv'
  brew 'git'
  brew 'gnupg'
  brew 'thoughtbot/formulae/rcm'
  brew 'reattach-to-user-namespace' if OS.mac?
  cask 'docker'
end

# tap 'homebrew/cask-fonts'
# cask 'font-FiraCode-nerd-font' unless ::Dir.glob("#{HOME}/Library/Fonts/FiraCode-*.otf").any?

'Because Corporate Environments...'.tap do |_|
  mas 'Microsoft Remote Desktop', id: 1295203466
end

'Bring MacOS up-to-date'.tap do |_|
  brew 'bash'
  brew 'bash-completion'
  brew 'gzip'
  brew 'less'
  brew 'openssl'
  brew 'openssh'
  brew 'rsync'
  brew 'zsh'
end

'Web browser'.tap do |_|
  # Primary
  cask 'firefox' unless ::File.exists?('/Applications/Firefox.app')
  # Backup
  cask 'brave-browser'
end

'Graphical desktop organizers'.tap do |_|
  cask 'alfred'
  cask 'spectacle'
end

'Communication'.tap do |_|
  cask 'telegram'
  cask 'slack' unless ::File.exists?('/Applications/Slack.app')
end

'Notes'.tap do |_|
  cask 'notion'
  cask 'simplenote'
end

'Coding workflow'.tap do |_|
  'Reconnaissance'.tap do |_|
    brew 'bat'
    brew 'jq'
    brew 'ripgrep'
  end

  'Auth'.tap do |_|
    brew 'keychain'

    # Helpers for KeePassXC
    tap 'theseal/ssh-askpass'
    brew 'ssh-askpass'
  end

  'IDE'.tap do |_|
    tap 'universal-ctags/universal-ctags'
    brew 'universal-ctags', args: ['head']

    tap 'neovim/neovim'
    brew 'neovim'

    brew 'tmux'

    cask 'kitty'
  end

  'Demonstrations'.tap do |_|
    brew 'tree'
    brew 'colordiff'
  end

  'Languages'.tap do |_|
    brew 'go'
  end

  'Dependencies'.tap do |_|
    brew 'gnutls' # still needed??? Why?
    brew 'libyaml'
    brew 'sqlite'
  end

  'Static analysis'.tap do |_|
    brew 'shellcheck'
    brew 'hadolint'
  end
end

'Infrastructure as Code'.tap do |_|
  brew 'dive'
  brew 'envconsul'
  brew 'nomad'
  brew 'vault'

  'Kubernetes'.tap do |_|
    brew 'krew'
    brew 'kubectx'
    brew 'stern'
  end
end

'Troubleshooting helpers'.tap do |_|
  brew 'mitmproxy'
  brew 'netcat'
  brew 'nmap'
  brew 'tcptraceroute'
end

'BSD commands -> GNU commands'.tap do |_|
  brew 'coreutils'  # Add `/usr/local/opt/coreutils/libexec/gnubin` to your PATH
  brew 'make'  # Add `/usr/local/opt/make/libexec/gnubin` to your PATH
end

'Ported from Linux'.tap do |_|
  brew 'cowsay'
  brew 'dos2unix'
  brew 'lz4'
  brew 'watch'
  brew 'wget'
end

'Image manipulation'.tap do |_|
  brew 'gifsicle'
  brew 'ffmpeg'
  brew 'graphviz'
end
